# DisableItem Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ContourSetting..::..DisableItem Method
ContourSetting Class See Also
---
Disable a contour setting item of the current contour setting so that the item will not be used to draw contours.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public void DisableItem(
	ContourSettingItem item
)
```

Visual Basic
---
```text
Public Sub DisableItem ( _
	item As ContourSettingItem _
)
```

Visual C++
---
```text
public:
void DisableItem(
	ContourSettingItem^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..ContourSettingItem The contour setting item to be disabled.
# Remarks
Contour setting will not be changed if the item could not be found.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ContourSetting Class
Autodesk.Revit.DB Namespace